#+TITLE: reformr 開発プロジェクトノート
#+PROPERTY: header-args :session *R:tidyNAS*

#+call: load-packages() :results silent

* パッケージ開発の準備
:LOGBOOK:
CLOCK: [2018-12-16 Sun 12:45]--[2018-12-16 Sun 13:13] =>  0:28
:END:
*** DONE パッケージ dir を作る
:LOGBOOK:
CLOCK: [2018-12-26 Wed 11:49]--[2018-12-26 Wed 12:18] =>  0:29
:END:
#+BEGIN_SRC R
  setwd("/Users/ahayashi/Documents/GitHub/tidyNAS/")
  list.files()
#  devtools::create("reformr")
#+END_SRC

#+RESULTS:


*** dir 確認
#+BEGIN_SRC bash :session nil :results output
ls reformr
#+END_SRC

#+RESULTS:
: DESCRIPTION	NAMESPACE	R		reformr.Rproj	tests
* データのリストを作ってみる
#+NAME: load_data
#+BEGIN_SRC R :session *R:tidyNAS* :var indir = "./data/鮮魚関係"
  list.files(indir, pattern = ".+[カタクチイワシ|マイワシ|マアジ]\\.xls", recursive = TRUE)
#+END_SRC

#+RESULTS: load_data
| 鮮魚測定06/カタクチイワシ.xls |
| 鮮魚測定06/マイワシ.xls       |
| 鮮魚測定07/カタクチイワシ.xls |
| 鮮魚測定07/マイワシ.xls       |
| 鮮魚測定08/カタクチイワシ.xls |
| 鮮魚測定08/マイワシ.xls       |
| 鮮魚測定09/カタクチイワシ.xls |
| 鮮魚測定09/マイワシ.xls       |
| 鮮魚測定10/カタクチイワシ.xls |
| 鮮魚測定10/マイワシ.xls       |
| 鮮魚測定11/カタクチイワシ.xls |
| 鮮魚測定11/マイワシ.xls       |
| 鮮魚測定12/カタクチイワシ.xls |
| 鮮魚測定12/マイワシ.xls       |
| 鮮魚測定13/カタクチイワシ.xls |
| 鮮魚測定13/マイワシ.xls       |
| 鮮魚測定14/カタクチイワシ.xls |
| 鮮魚測定14/マイワシ.xls       |
| 鮮魚測定15/カタクチイワシ.xls |
| 鮮魚測定15/マイワシ.xls       |
| 鮮魚測定16/カタクチイワシ.xls |
| 鮮魚測定16/マイワシ.xls       |
| 鮮魚測定17/カタクチイワシ.xls |
| 鮮魚測定17/マイワシ.xls       |
| 鮮魚測定18/カタクチイワシ.xls |
| 鮮魚測定18/マイワシ.xls       |
| 鮮魚測定19/カタクチイワシ.xls |
| 鮮魚測定19/マイワシ.xls       |

* 再ロードしてテストする
#+BEGIN_SRC R :results table
  devtools::load_all("reformr")
  devtools::test("reformr")
#+END_SRC

#+RESULTS:
| test_filestring.R | Parse file and sheet names | make_datlist make data list correctly                            | 0 | 0 | FALSE | TRUE  | 0 | 0.000999999999999446 | 0 | 0.00100000000020373 |
| test_format.R     | Formatting loaded data     | format() cleanses data                                           | 1 | 0 | TRUE  | FALSE | 0 |                    0 | 0 | 0.00100000000020373 |
| test_param.R      | Handle param object        | make_params accept only 'sengyo' or 'cruise'                     | 2 | 0 | FALSE | FALSE | 0 |  0.00200000000000067 | 0 | 0.00199999999676947 |
| test_param.R      | Handle param object        | make_params accept only 'カタクチイワシ', 'マイワシ' or 'マアジ' | 2 | 0 | FALSE | FALSE | 0 |  0.00199999999999889 | 0 | 0.00200000000040745 |

**** DONE 陽光丸稚魚
:LOGBOOK:
CLOCK: [2018-12-28 Fri 11:05]--[2018-12-28 Fri 15:44] =>  4:39
CLOCK: [2018-12-14 Fri 15:14]--[2018-12-14 Fri 16:57] =>  1:43
- 2011から2013まで完了
:END:

****** 関数定義
dfを読み込むのではなく，ファイル名を読み込むように変更するべき．
:PROPERTIES:
:ORDERED:  t
:END:
#+BEGIN_SRC R
  format_trawl_shimane <- function(df) {
      df %>%
        transmute(date.collected = ymd(`月日`),
                  cruise.number = `回次`,
               station = Stn.,
               lat.trawl.start_org = 曳網開始位置,
               lon.trawl.start_org = 曳網開始位置__1,
               tow.duration_min = 曳網時間,
               tow.speed_kt = 曳網速度,
               tow.depth_m = `曳網水深（最大）`,
               n.Trachurus.japonicus = マアジ,
               t0   = `0m`,
               t10  = `10m`,
               t20  = `20m`,
               t30  = `30m`,
               t50  = `50m`,
               t75  = `75m`,
               t100 = `100m`,
               t150 = `150m`,
               t200 = `200m`,
               t300 = `300m`,
               s0   = `0m (1m)`,
               s10  = `10m__1`,
               s20  = `20m__1`,
               s30  = `30m__1`,
               s50  = `50m__1`,
               s75  = `75m__1`,
               s100 = `100m__1`,
               s150 = `150m__1`,
               s200 = `200m__1`,
               s300 = `300m__1`) %>%
        mutate(year = year(date.collected),
               month = month(date.collected) %>%
                 formatC(width=2, flag="0"),
               day = day(date.collected),
               pseudo.month = ifelse(cruise.number == 1, "05",
                                      ifelse(cruise.number == 2, "06", "07")),
               cruise.name = paste0("Shimane", substr(year, 3, 4), pseudo.month, "JM"),
               id1 = paste(cruise.name, station, sep="_"),
               lat.trawl.start_deg = str_sub(lat.trawl.start_org, 1, 2) %>%
                 parse_number(),
               lat.trawl.start_min = str_sub(lat.trawl.start_org, 3, -1) %>%
                 parse_number(),
               lat.trawl.start_decimal = lat.trawl.start_deg + lat.trawl.start_min/60,
               lon.trawl.start_deg = str_sub(lon.trawl.start_org, 1, 3) %>%
                 parse_number(),
               lon.trawl.start_min = str_sub(lon.trawl.start_org, 4, -1) %>%
                 parse_number(),
               lon.trawl.start_decimal = lon.trawl.start_deg + lon.trawl.start_min/60
               ) %>%
        select(-lat.trawl.start_org, -lon.trawl.start_org)
    }
#+END_SRC

:LOGBOOK:
CLOCK: [2019-01-08 Tue 11:51]--[2019-01-08 Tue 12:25] =>  0:34
:END:
******* 2012年を力技で整形
:LOGBOOK:
CLOCK: [2019-01-08 Tue 13:05]--[2019-01-08 Tue 14:11] =>  1:06
:END:
#+BEGIN_SRC R :results silent
  year                    <- 2012
  border_may_jun          <- as.Date(paste(year, "-05-25", sep=""))
  border_jun_jul          <- as.Date(paste(year, "-06-25", sep=""))

  trawl_shimane2012_org <- read_xlsx(paste0(datdir_jm_org, "2012島根県マアジ加入量調査データ.xlsx"), sheet="for me", skip=1,
                            col_types = c("text", "numeric", "date", "text",
                                          rep("numeric", 4), "date", rep("numeric", 6)))
  trawl_shimane2012 <- trawl_shimane2012_org %>%
    rename(prefec = X__1,
           no = X__2,
           date.collected = X__3,
           station = X__4,
           lat.obs = 北緯,
           lon.obs = 東経,
           lat.trawl.start_degmin = 北緯__1,
           lon.trawl.start_degmin = 東経__1,
           time.trawl.start = X__5,
           t0  = `0m`,
           t10 = `10m`,
           t20 = `20m`,
           t30 = `30m`,
           t50 = `50m`,
           n.Trachurus.japonicus = マアジ) %>%
    mutate(date.collected = ymd(date.collected),
           year = year(date.collected),
           month = month(date.collected) %>%
                     formatC(width = 2, flag = 0),
           day = day(date.collected),
           lat.trawl.start_degmin = parse_number(lat.trawl.start_degmin),
           lon.trawl.start_degmin = parse_number(lon.trawl.start_degmin),
           lat.trawl.start_deg = floor(lat.trawl.start_degmin),
           lat.trawl.start_min = (lat.trawl.start_degmin-lat.trawl.start_deg)*100,
           lon.trawl.start_deg = floor(lon.trawl.start_degmin),
           lon.trawl.start_min = (lon.trawl.start_degmin-lon.trawl.start_deg)*100,
           tow.speed_kt = 3.0,
           tow.duration_min = 30,
           cruise.name = paste0("Shimane", substr(year,3,4), ifelse(date.collected < border_may_jun, "05JM",
                                   ifelse(date.collected > border_jun_jul, "07JM",
                                           "06JM"))))
#+END_SRC

